Revit 2026 API

# ExportPatternTableIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual KeyValuePair<ExportPatternKey, ExportPatternInfo> Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As KeyValuePair(Of ExportPatternKey, ExportPatternInfo)
	Get
```
```cpp
public:
virtual property KeyValuePair<ExportPatternKey^, ExportPatternInfo^> Current {
	KeyValuePair<ExportPatternKey^, ExportPatternInfo^> get ();
}
```
```fsharp
abstract Current : KeyValuePair<ExportPatternKey, ExportPatternInfo> with get
override Current : KeyValuePair<ExportPatternKey, ExportPatternInfo> with get
```

#### Property Value

KeyValuePairExportPatternKey, ExportPatternInfo

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

ExportPatternTableIterator Class

Autodesk.Revit.DB Namespace